# 演習５　配列

# 5-1 次のプログラムを修正し、配列numにある数の合計を表示させなさい。
# --------------------------------------

num = [2, 9, 12, 16, 26, 53, 92, 96, 105, 158]
sum = 0

for i in range(0,len(num),1):
    sum = sum + num[i]

print(sum)

# --------------------------------------


# 5-2 次のプログラムを修正し、配列evenに0から100までの偶数を格納しなさい。
# --------------------------------------

even = []

for i in range(0,101,2):
    even.append(i)

print(even)

# --------------------------------------


# 5-3 次のプログラムに加筆し、配列gに格納された文字を使って「おはよう」とコンソールに表示させなさい。
# --------------------------------------

g = [
    ["あ", "い", "う", "え", "お"],
    ["か", "き", "く", "け", "こ"],
    ["さ", "し", "す", "せ", "そ"],
    ["た", "ち", "つ", "て", "と"],
    ["な", "に", "ぬ", "ね", "の"],
    ["は", "ひ", "ふ", "へ", "ほ"],
    ["ま", "み", "む", "め", "も"],
    ["や", "ゆ", "よ"],
    ["ら", "り", "る", "れ", "ろ"],
    ["わ", "を", "ん"],
    ["が", "ぎ", "ぐ", "げ", "ご"],
    ["ざ", "じ", "ず", "ぜ", "ぞ"],
    ["だ", "じ", "ず", "ぜ", "ぞ"],
    ["ば", "び", "ぶ", "べ", "ぼ"],
    ["ぱ", "ぴ", "ぷ", "ぺ", "ぽ"],
    ["ぁ", "ぃ", "ぅ", "ぇ", "ぉ","ゃ","ゅ","ょ"]
]

print(g[0][4], g[5][0], g[7][2], g[0][2])

# --------------------------------------