# プログラミング学習の進め方 practice編


# 「practice_(数字).py」は、basicで学んだ内容の演習をするファイルです。

# 演習では、プログラムを修正する問題を2問～3問解きます。
# そのまま実行するとエラーが起こります。エラーが起こらないようにプログラムを改変してください。

# もしプログラムの状態を戻したい場合は、「Ctrl + Z」をすると、一つ前の状態に戻せます。
# 「Ctrl」キーを押しながら「Z」キーを連打すれば、最初の状態に戻ります。

# 必ず対応するbasicの内容を見てから臨んでください。

# *********************************************************************************************



# 演習１　順次構造

# 1-1
# 次のプログラムに加筆し、変数の中身をコンソールに表示させなさい。
# --------------------------------------

text = "初めてのpython"
print()

# --------------------------------------


# 1-2
# 次のプログラムを修正し、計算結果を正常に表示させなさい。
# --------------------------------------

number_1 = 15
number_2 = 20

print("計算結果： " + number_1 + number_2)

# --------------------------------------


# 1-3
# 次のプログラムを修正して、計算結果が正常に出力されるようにしなさい。
# --------------------------------------

print("x + y + z の結果", x + y + z)
x = 2
y = 3
z = 4

# --------------------------------------
